results/factorial-final/security-overhead-final-tls-broker3/security-overhead-final-factorial-tls-b3-rf3-isr3-msg10240-tps10000-batch16384-acks1-prod12-complz4-trial1/producer-perf-4.log
producer_index=4
producer_count=12
producer_records=8334
producer_throughput=834
1 records sent, 0.1 records/sec (0.00 MB/sec), 14879.0 ms avg latency, 14879.0 ms max latency.
136 records sent, 26.8 records/sec (0.26 MB/sec), 5463.3 ms avg latency, 7409.0 ms max latency.
252 records sent, 49.8 records/sec (0.49 MB/sec), 9015.7 ms avg latency, 10828.0 ms max latency.
438 records sent, 87.2 records/sec (0.85 MB/sec), 11670.9 ms avg latency, 12764.0 ms max latency.
686 records sent, 136.6 records/sec (1.33 MB/sec), 13791.2 ms avg latency, 15010.0 ms max latency.
986 records sent, 196.3 records/sec (1.92 MB/sec), 15468.8 ms avg latency, 16365.0 ms max latency.
1210 records sent, 241.1 records/sec (2.35 MB/sec), 11004.1 ms avg latency, 14514.0 ms max latency.
1270 records sent, 253.5 records/sec (2.48 MB/sec), 8473.1 ms avg latency, 9373.0 ms max latency.
1473 records sent, 294.5 records/sec (2.88 MB/sec), 7758.3 ms avg latency, 8372.0 ms max latency.
8334 records sent, 139.025123 records/sec (1.36 MB/sec), 9511.59 ms avg latency, 16365.00 ms max latency, 8330 ms 50th, 15599 ms 95th, 16187 ms 99th, 16324 ms 99.9th.